#pragma once

void ApproachKeyword(string& kw)
{	//去除空格和标点
	string kw2{ "" };
	for (char ch : kw)
		if (!isspace(ch) && !ispunct(ch))
			kw2 += ch;
	kw = kw2;
}
map<string, string> help_content
{
	{"起床", "起床战争(Bedwar)的简写"},
	{"起床战争", "建议先去网上找点起床战争的视频看看再来此直播间"},
	{"GG", "Good Game 的缩写，常在游戏结束后发送。"},
	{"床", "代表队伍的重生资格，如果床被破坏，该队队员无法重生。床被摧毁且全员死亡时该队被淘汰"},
	{"床防御", "在床上覆盖的种种方块，可以抵御敌方对床的破坏，但是需要注意加固和修补"},
	{"搭路", "连接两个岛屿的手段。输入其中一种方式开始搭路：蹲搭、蹲起搭、月步、神桥。输入搭路默认为蹲起搭。在后面跟上一个字母可以指定哪条路，字母可以为A,B,C"},
	{"搭桥", "连接两个岛屿的手段。输入其中一种方式开始搭桥：蹲搭、蹲起搭、月步、神桥。在后面跟上一个字母可以指定哪条路，字母可以为A,B,C"},
	{"蹲搭", "新手初始的搭路方式，缓慢但免费"},
	{"蹲起搭", "好用的搭路方式，但是你必须成功使用蹲搭至少" + str(NINJA_AVAILABLE_BASE_CNT) + "次"},
	{"月步", "速度极快，但是你必须成功使用蹲起搭至少" + str(MOONWALK_AVAILABLE_BASE_CNT) + "次"},
	{"神桥", "速度比月步还快，但是你必须成功使用月步至少" + str(GODBRIDGE_AVAILABLE_BASE_CNT) + "次"},
	{"升级镐子", "将挖床用的镐子升级一级。镐子只能一级一级升，不能跨级购买。"},
	{"升级武器", "升级你的永久武器。武器只能一级一级升，不能跨级购买。"},
	{"经验", "起床战争经验模式的基本货币"},
	{"钻石", "钻石是起床战争中关键的资源，用于团队升级"},
	{"绿宝石", "在该模式下，1绿宝石=100经验，在中心岛定期生成"},
	{"捡钻石", "从钻石岛获得一颗钻石，必须在中心岛输入该命令才可以生效"},
	{"羊毛", "购买4个羊毛围床。注意：床防御仅在方块数量>=八个时才有效"},
	{"末地石", "购买末地石围床。可靠的防御方块"},
	{"木板", "购买木板围床。有用的防御方块"},
	{"玻璃", "防爆玻璃。外面的爆炸无法摧毁玻璃里面的方块"},
	{"黑曜石", "具有非常高的硬度，绝佳的防御方块"},
	{"水", "在床顶部放水。减缓附近的生物移动速度，包括自家的。在床防御较厚时，大大降低敌方对防御的挖掘速度。"},
	{"末影珍珠", "进行快速移动。相关操作命令：珍珠回城、珍珠突袭、珍珠向左、珍珠向右、珍珠往高处扔、珍珠平抛"},
	{"珍珠回城", "向自己家扔珍珠，仅在横向宽度小于3/4个屏幕宽时可以生效"},
	{"珍珠突袭", "向敌方家扔珍珠，仅在横向宽度小于3/4个屏幕宽时可以生效"},
	{"珍珠向左", "向左侧扔珍珠，一般情况下都可以扔中，默认中等力度"},
	{"珍珠向右", "向右侧扔珍珠，一般情况下都可以扔中，默认中等力度"},
	{"珍珠投掷方式", "目前有两种：\"珍珠往高处扔\" \"珍珠平抛\"，而默认方式为中等力度，介于两者之间，扔的距离最远。"},
	{"珍珠往高处扔", "一般用于近距离传送。"},
	{"珍珠平抛", "几乎水平地向前扔出珍珠。一般用于贴脸杀或者给逃跑者补刀"},
	{"TNT", "在玩家处进行一次爆破。相关操作命令：TNT、TNT跳、TNT炸床"},
	{"TNT跳", "在玩家处使用TNT，将玩家炸到指定位置。相关用法：TNT向左跳、TNT向右跳"},
	{"TNT炸床", "在敌方家中生效，在床的位置精准放置TNT进行爆破"},
	{"TNT向左跳", "用TNT把自己向左炸飞，距离未知。"},
	{"TNT向右跳", "用TNT把自己向右炸飞，距离未知。"},
	{"烈焰弹", "向玩家前方扔烈焰弹，对床防御也有破坏作用。相关操作命令：火球跳、火球回跳"},
	{"火球跳", "在脚底扔火球，使自己向前飞行一段距离"},
	{"火球回跳", "在脚前方扔火球，使自己往身后飞行一段距离"},
	{"金苹果", "吃完后提供 4 点额外血量以及 5 秒的生命恢复"},
	{"治疗药水", "服用后瞬间治疗 12 滴血，短时间内效果远好于金苹果"},
	{"隐身药水", "服用，隐身30秒，受伤或死亡后显形"},
	{"跳跃药水", "服用，跳跃提升30秒，可以很好地跳过敌怪"},
	{"迅捷药水", "服用，迅捷120秒，提升移动速度"},
	{"力量药水", "服用，力量60秒，攻击力提升到200%"},
	{"海绵", "一次性物品，使用后可以去除附近床上的水源"},
	{"自救平台", "该物品没有制作！"},
	{"团队升级", "对队伍全员玩家生效的一些加成，货币为钻石"},
	{"锋利附魔", "提高队伍所有玩家的近战攻击伤害"},
	{"护甲强化", "提高队伍所有玩家的防御值"},
	{"经验熔炉", "提高家里经验的产生速率"},
	{"疯狂矿工", "提高队伍所有玩家对敌方家防御的挖掘速度"},
	{"陷阱", "该团队升级项没有制作！"},
	{"治愈池", "该团队升级项没有制作！"},
	{"回城卷轴", "该物品没有制作！"},
	{"防御塔", "该物品没有制作！"},
	{"击退棒", "该物品没有制作！"},
	{"搭路蛋", "该物品没有制作！请输入搭路方式进行搭路"},
	{"僵尸", "召唤基础敌怪，近战攻击"},
	{"蠹虫", "廉价的虫子对敌人进行近战攻击"},
	{"骷髅", "召唤弓兵小白，射程有限制"},
	{"苦力怕", "靠近敌人后会触发自杀式爆炸袭击，也可以有效破坏敌方床防御"},
	{"卫道士", "持有锋利的斧头,高额近战攻击伤害"},
	{"掠夺者", "强悍的弩手，射程有限制"},
	{"烈焰人", "定期向敌人发射小火球，也可以近战攻击"},
	{"小火球", "和烈焰弹不同，小火球不能发生爆炸"},
	{"回去", "让玩家掉头"},
	{"回家", "向家的方向走"},
	{"向左", "让玩家朝左"},
	{"向右", "让玩家朝右"},
	{"停住", "让玩家停止走路，\"起步\"或\"继续走\"让玩家继续"},
	{"起步", "让玩家继续走路，别名：\"继续走\""},
	{"复活", "复活玩家。输入\"重生\"也可以"},
	{"打赏", "成年人欢迎打赏，虽然还没有加氪金机制"},
	{"礼物", "谢谢你的礼物，虽然还没有加氪金机制"},
	{"屏蔽词", "该直播间弹幕具有对特定词汇的屏蔽机制"},
	{"作者", "Wormwaker"},
	{"关于", "起床战争直播互动版, 作者：@Wormwaker"},
};
void PrintHelp(const string& s)
{
	if (help_content.find(s) == help_content.end())
	{
		chat.AddChat("目前还没有\"" + s + "\"的相关帮助信息！", CORNSILK);
		return;
	}
	chat.AddChat(help_content[s], CORNSILK);
}